Import numpy and pandas

In [25]:
import numpy as np
import pandas as pd

Create a python dictionary with 5 labels and 5 numbers of your choice.
Call it my_data.

In [26]:
my_data = {"a": 1, "b": 2, "c": 3, "d": 4, "e": 5}

Create a pandas Series from the my_data dictionary, called my_series.
Display it.

In [27]:
my_series = pd.Series(my_data)
my_series

a    1
b    2
c    3
d    4
e    5
dtype: int64

Create a 5x5 array of random integers, from 0 to 100 called nums.
Display it.

In [31]:
arr = np.random.randint(0, 100, (5,5))
#new_arr = arr.reshape(5,5)
arr
#new_arr

array([[95, 66, 36, 88, 52],
       [22, 65, 38, 53,  9],
       [28, 84, 22, 68, 69],
       [94, 71, 63, 21, 77],
       [22, 42, 12,  7,  5]])

Create a DataFrame from the nums array, called df.
Label the columns: A,B,C,D,E
Label the index: V,W,X,Y,Z
Display the DataFrame.

In [32]:
df = pd.DataFrame(new_arr, index=["V","W","X","Y","Z"], columns=["A","B","C","D","E"])
df

    A   B   C   D   E
V  86  56  26  17  82
W   4  86  62   6  77
X   5  34  71   3   5
Y  59  72   6  86  73
Z  48  94   4   2  86

Display columns B and D.

In [33]:
df[["B","D"]]

    B   D
V  56  17
W  86   6
X  34   3
Y  72  86
Z  94   2

Display rows X and Y.

In [34]:
df.loc[["X","Y"]]

    A   B   C   D   E
X   5  34  71   3   5
Y  59  72   6  86  73

Display element YC.

In [35]:
df.loc["Y","C"]

6

Display rows X and Y, and columns B and D.

In [36]:
df.loc[["X","Y"],["B","D"]]

    B   D
X  34   3
Y  72  86

Add a new column F, which is column A x column B.
Display the resulting DataFrame.

In [37]:
df["F"] = df["A"] * df["B"]
df

    A   B   C   D   E     F
V  86  56  26  17  82  4816
W   4  86  62   6  77   344
X   5  34  71   3   5   170
Y  59  72   6  86  73  4248
Z  48  94   4   2  86  4512

Permanently drop row V and column F.
Display the resulting DataFrame.

In [38]:
df.drop(index = "V", columns = "F", inplace=True)
df

    A   B   C   D   E
W   4  86  62   6  77
X   5  34  71   3   5
Y  59  72   6  86  73
Z  48  94   4   2  86